src/cf/InformationRegisters/Share.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>Share</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВариантУдаления</Name>
					<Comment>0 - не удалять, 1 - Удалить после получения, 2 - удалить в указанную дату</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУдаления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/ShareСервер/Ext/Module.bsl
Процедура Share_УдалитьСсылкиПоДате() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("ДатаУдаления", НачалоДня(ТекущаяДата()));
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ИсточникДанных.ID КАК ID
	|ИЗ
	|	РегистрСведений.Share КАК ИсточникДанных
	|ГДЕ
	|	ИсточникДанных.ВариантУдаления = 2
	|	И ИсточникДанных.ДатаУдаления <= &ДатаУдаления
	|";
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи=РегистрыСведений.Share.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ID=Выборка.ID;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Удалить();
		КонецЕсли;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура Share_ДобавитьРоль() Экспорт
	Если НЕ РольДоступна(Метаданные.Роли.Share) Тогда
		ТекущийПользователь=ПользователиИнформационнойБазы.ТекущийПользователь();	
		ТекущийПользователь.Роли.Добавить(Метаданные.Роли.Share);
		ТекущийПользователь.Записать();
	КонецЕсли;
КонецПроцедуры
